<template>
  <div class="about">
    <articleItem
    :articles="articles"
    />
  </div>
</template>

<script>
import articleItem from '@/components/articleItem'
export default {
  data:()=>({
    articles:[
      {id:1,heading:`Мебель от производителя в Краснодаре`,texts:[
        `Наша компания предлагает вам качественную мебель в Краснодаре разного назначения - кухонные и спальные гарнитуры,шкафы и диваны,стенки,горки,тумбы,прихожие и др.
        Вся продукция поставляется напрямую от производителя.`,
        `Все конструкции отличаются высоким качеством,поскольку для их изготовления
          используется безопасное сырье и надежная фурнитура от ведущих компаний.
          Приобрести понравившийся товар вы можете в любое удобное время`],
          moreInfoItems:[]
      },
      {id:2,heading:`Больше, чем интернет-магазин мебели`,texts:[
        `Возможность создать неповторимый интерьер квартиры,сделать обстановку  дома уютной,
          пребывание гостей в офисе-комфортабельным.А для нас,команды Дивана,мебель - это объект искреннего интереса и увлечения.
          Поэтому мы неизменно растем и стараемся предложить лучший ассортимент мебельного рынка`],
          moreInfoItems:[
            {
              subHeading:`Модно`,
              moreText:`Мы активно следим за современными тенденциями,постоянно развиваем
               собственные навыки и возможности производства`
            },
            {
              subHeading:`Молодёжно`,
              moreText:`Кроме изделий собственного производства мы предлагаем
              в каталоге широкий ассортимент диванов и другой мебели известных фабрик
              Москвы и России`
            }
          ]
      },
    ]
  }),
  components:{
    articleItem
  }
}
</script>

<style lang="scss">
@import "../assets/styles/variables";
@import "../assets/styles/mixins";
.about{
  padding-bottom:120px;
}
</style>
